import hotels from '@images/Hotels.jpg';
import plane from '@images/plane.jpg';
import vip from '@images/vip.jpg';

const headerConfig = [
  {
    labelText: 'Пасажирам',
    idNum: '-1',
    modalData: {
      headerNav: {
        img: plane,
        title: 'Авіаквитки',
        subtitle: 'Ви маєте можливість купити квитки онлайн',
        btnText: 'КУПИТИ КВИТОК',
      },
      links: [
        {
          title: 'Інформація',
          links: [
            'COVID-19',
            'Напередодні вильоту',
            'Напередодні вильоту',
            'Авіабезпека',
            'Митний контроль',
            'Прикорднонний контроль',
            'Людям з інвалідністю',
            'Подорож із тваринами',
            'Схема Аеропорту',
            'Контакти',
          ],
        },
        {
          title: 'Загальне',
          links: [
            'Онлайн-розклад',
            'Як дістатися',
            'Парковка',
            'Усе про багаж',
            'Кімнати матері та дитини',
            'Авіакомпанії',
            'Ресторани та магазини',
            'Mastercard Fast Line',
            'Форма відгуків та пропозицій',
          ],
        },
      ],
    },
  },
  {
    labelText: 'Послуги IEV',
    idNum: '-2',
    modalData: {
      headerNav: {
        img: hotels,
        title: 'Готелі світу',
        subtitle: 'Бронюйте готелі по всьому світу за найкращими цінами',
        btnText: 'ЗНАТИ',
      },
      links: [
        {
          title: 'Усі послуги',
          links: [
            'Тестування на COVID-19',
            'Priority line',
            'Express Line',
            'Бізнес-зала',
            'VIP-обслуговування',
            'Готель IEV',
          ],
        },
        {
          title: 'Трансфер',
          links: [
            'Пакування багажу',
            'Довгострокове паркування',
            'Придбати авіаквитки',
            'Готелі світу',
            'Парковка',
          ],
        },
      ],
    },
  },
  {
    labelText: 'VIP',
    idNum: '-3',
    modalData: {
      headerNav: {
        img: vip,
        title: 'Термінал B',
        subtitle: 'Швидкість, комфорт, конфіденційність.',
        btnText: 'ЗАМОВИТИ',
      },
      links: [
        {
          title: 'Термінал B',
          links: ['VIP-обслуговування', 'Трансфер', 'Готель IEV', 'Приватний рейс'],
        },
        {
          title: 'Тарифи та правила',
          links: ['Артгалерея', 'Віртуальний тур', 'Контактна інформація'],
        },
      ],
    },
  },
  {
    labelText: 'Партнерам',
    idNum: '-4',
    modalData: {
      headerNav: {
        img: plane,
        title: 'Авіаквитки',
        subtitle: 'Ви маєте можливість купити квитки онлайн',
        btnText: 'Купити квиток',
      },
      links: [
        {
          title: 'Партнерам',
          links: [
            'Наші можливості',
            'Характеристики аеропорту',
            'Учбовий центр',
            'Заявка на навчання в УЦ',
            'Вантажний Термінал',
            'Вакансії',
            'Контакти',
          ],
        },
      ],
    },
  },
  {
    labelText: 'Пресцентр',
    idNum: '-5',
    modalData: {
      headerNav: {
        img: plane,
        title: 'Авіаквитки',
        subtitle: 'Ви маєте можливість купити квитки онлайн',
        btnText: 'Купити квиток',
      },
      links: [
        {
          title: 'Пресцентр',
          links: [
            'Головна пресцентру',
            'Новини',
            'Соц. і артпроекти',
            'Статистика',
            'Фінансова звітність',
          ],
        },
      ],
    },
  },
];

export default headerConfig;
