const footerConfig = [
  {
    title: 'Пасажирам',
    links: [
      'Розклад рейсів',
      'Замовлення послуг',
      'Контактна інформація',
      'Політика конфіденційності',
      'Форма відгуків та пропозицій',
    ],
  },
  {
    title: 'Партнерам',
    links: [
      'Головна',
      'Наземне обслуговування',
      'Характеристики аеродрому',
      'Учбовий центр',
      'Ваканції',
    ],
  },
  {
    title: 'Пресцентр',
    links: [
      'Головна пресцентру',
      'Останні новини',
      'Соціальні та артпроекти',
      'Фінансова звітність',
      'Статистика пасажиропотоку',
    ],
  },
];

export default footerConfig;
